In [2]:
import pandas as pd

### Use the following lists to build the data frame below using dictionary method as we done in the session

In [3]:
data = {
    'students' :[ 'Naomi', 'Yumi','Hinata','Hana', 'Akira', 'Yuki','Yudi', 'Sakura', 'Sasuke','Hiroshi', 'Ken', 'Emi'],
    'mathematics' : [1, 3, 1, 3, 4, 3, 1, 9, 5, 9, 1, 2],
'chemestry' : [6, 5, 5, 8, 6, 6, 5, 3, 7, 8, 6, 4],
'biology' : [8, 7, 9, 9, 7, 7, 8, 7, 7, 7, 7, 9],
'economy' : [3, 2, 7, 8, 9, 9, 5, 9, 8, 6, 7, 9]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   students  mathematics  chemestry  biology  economy
0     Naomi            1          6        8        3
1      Yumi            3          5        7        2
2    Hinata            1          5        9        7
3      Hana            3          8        9        8
4     Akira            4          6        7        9
5      Yuki            3          6        7        9
6      Yudi            1          5        8        5
7    Sakura            9          3        7        9
8    Sasuke            5          7        7        8
9   Hiroshi            9          8        7        6
10      Ken            1          6        7        7
11      Emi            2          4        9        9

# Find the Descriptive statistics of the data

In [6]:
df.describe()

       mathematics  chemestry    biology    economy
count    12.000000  12.000000  12.000000  12.000000
mean      3.500000   5.750000   7.666667   6.833333
std       2.876235   1.484771   0.887625   2.405801
min       1.000000   3.000000   7.000000   2.000000
25%       1.000000   5.000000   7.000000   5.750000
50%       3.000000   6.000000   7.000000   7.500000
75%       4.250000   6.250000   8.250000   9.000000
max       9.000000   8.000000   9.000000   9.000000

# create a new column to store the students' final grade

In [8]:
 df['Final_score'] = df['mathematics'] + df['chemestry'] + df['biology'] + df['economy']

In [11]:
df

   students  mathematics  chemestry  biology  economy  Final_score
0     Naomi            1          6        8        3           18
1      Yumi            3          5        7        2           17
2    Hinata            1          5        9        7           22
3      Hana            3          8        9        8           28
4     Akira            4          6        7        9           26
5      Yuki            3          6        7        9           25
6      Yudi            1          5        8        5           19
7    Sakura            9          3        7        9           28
8    Sasuke            5          7        7        8           27
9   Hiroshi            9          8        7        6           30
10      Ken            1          6        7        7           21
11      Emi            2          4        9        9           24

## create a new column to inform whether the student has been approved or not, based on the final grade (the grade must be greater than or equal to 25); to do so, create a function and use the pandas apply () method.

In [12]:
df['Status'] = df['Final_score'].apply(lambda x: 'approved' if x >= 25 else 'Rejected')

In [15]:
df

   students  mathematics  chemestry  biology  economy  Final_score    Status
0     Naomi            1          6        8        3           18  Rejected
1      Yumi            3          5        7        2           17  Rejected
2    Hinata            1          5        9        7           22  Rejected
3      Hana            3          8        9        8           28  approved
4     Akira            4          6        7        9           26  approved
5      Yuki            3          6        7        9           25  approved
6      Yudi            1          5        8        5           19  Rejected
7    Sakura            9          3        7        9           28  approved
8    Sasuke            5          7        7        8           27  approved
9   Hiroshi            9          8        7        6           30  approved
10      Ken            1          6        7        7           21  Rejected
11      Emi            2          4        9        9           24  Rejected

In [14]:
df[df['Status'] == 'Rejected']

   students  mathematics  chemestry  biology  economy  Final_score    Status
0     Naomi            1          6        8        3           18  Rejected
1      Yumi            3          5        7        2           17  Rejected
2    Hinata            1          5        9        7           22  Rejected
6      Yudi            1          5        8        5           19  Rejected
10      Ken            1          6        7        7           21  Rejected
11      Emi            2          4        9        9           24  Rejected

In [16]:
df[df['Status'] == 'approved']

  students  mathematics  chemestry  biology  economy  Final_score    Status
3     Hana            3          8        9        8           28  approved
4    Akira            4          6        7        9           26  approved
5     Yuki            3          6        7        9           25  approved
7   Sakura            9          3        7        9           28  approved
8   Sasuke            5          7        7        8           27  approved
9  Hiroshi            9          8        7        6           30  approved